using Core.Models.Search;

/// <summary>
/// Універсальна модель результату пошуку з підтримкою пагінації.
/// Містить колекцію знайдених елементів та метадані пагінації.
/// Використовується для повернення списків даних у API.
/// </summary>
/// <typeparam name="T">
/// Тип елементів, що повертаються у результаті пошуку.
/// </typeparam>
public class SearchResult<T>
{
    /// <summary>
    /// Колекція елементів, що відповідають умовам пошуку.
    /// </summary>
    public List<T> Items { get; set; } = new();

    /// <summary>
    /// Інформація про пагінацію:
    /// поточна сторінка, загальна кількість сторінок,
    /// кількість елементів на сторінці та загальна кількість елементів.
    /// </summary>
    public PaginationModel Pagination { get; set; } = new();
}

